var data1 = [{
        question: '公司基层管理人员和承担财会、购销、项目负责等重要岗位的人员，不适用《公司关于领导人员廉洁从业的实施细则》 。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：公司基层管理人员和承担财会、购销、项目负责等重要岗位的人员，同样适用《公司关于领导人员廉洁从业的实施细则》']
    },


    {
        question: '国有企业领导人员经批准后，可以个人或者其他名义用企业资产在国（境）外注册公司、投资入股、购买金融产品、购置不动产或进行其他经营活动。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：国有企业领导人员，不得以个人或者其他名义用企业资产在国（境）外注册公司、投资入股、购买金融产品、购置不动产或进行其他经营活动。']
    },


    {
        question: '反腐倡廉建设，必须反对特权思想、特权现象。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '国有企业领导人员未经企业领导班子集体研究，可以决定大额度资金运作事项。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：国有企业大额度资金运作需按“三重一大”经企业领导班子集体研究决定，任何个人不能决定或更改集体决议。']
    },


    {
        question: '反腐倡廉必须常抓不懈，拒腐防变必须警钟长鸣，关键就在‘常’、‘长’二字。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '《廉政准则》规定，党员领导干部不准接受可能影响公正执行公务的礼品、宴请以及旅游、健身、娱乐等活动安排。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },



    {
        question: '国有企业领导人员离职后可以接受本企业的关联企业、与本企业有业务关系的企业，以及管理和服务对象提供的物质性利益。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：国有企业领导人员离职后不得接受本企业的关联企业、与本企业有业务关系的企业，以及管理和服务对象提供的物质性利益。']
    },


    {
        question: '《关于党风廉政建设责任制的规定》规定，领导干部违反党风廉政建设责任制，情节严重的，给予党纪政纪处分，或者给予调整职务、责令辞职、免职和降职等组织处理。涉嫌犯罪的，移送司法机关依法处理。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },



    {
        question: '国有企业的监事会应当加强对国有企业领导人员廉洁从业情况的监督。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '国有企业领导人员不得超出报销履行国有资产出资人职责的机构备案的预算进行职务消费。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },

    {
        question: '《关于党风廉政建设责任制的规定》规定，党委（党组）无需将检查考核情况在适当范围内通报。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析： 党委（党组）应当将检查考核情况在适当范围内通报。对检查考核中发现的问题，要及时研究解决，督促整改落实。']
    },





    {
        question: '会议决定“三重一大”多个事项时，要逐个表决，主要负责人应最后发表结论性意见。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '国有企业领导人员违反本规定获取的不正当经济利益，应当责令清退；给国有企业造成经济损失的，应当依据国家或者企业的有关规定承担经济赔偿责任。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '《廉政准则》规定，党员领导干部禁止讲排场、比阔气、挥霍公款、铺张浪费。不准报销招待费、差旅费等相关费用。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：《廉政准则》规定，党员领导干部禁止讲排场、比阔气、挥霍公款、铺张浪费。不准报销超出标准的招待费、差旅费等相关费用。']
    },


    {
        question: '《廉政准则》规定，党员领导干部禁止违反规定干预和插手市场经济活动，谋取私利。不准干预和插手批办各类行政许可和资金借贷等事项。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '在讨论涉及本人及直系亲属的“三重一大”议题时，本人必须主动回避，不得参与事项的表决，但在讨论与本人的近姻亲有关的议题时，可以不用回避，可以正常参与表决。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：在讨论与本人及其直系亲属或姻亲有关的议题时，本人必须主动回避，不得参与事项的表决。']
    },


    {
        question: '党员受到开除党籍处分，三年内不得重新入党。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：党员受到开除党籍处分，五年内不得重新入党。']
    },


    {
        question: '《中国共产党纪律处分条例》规定：违反有关规定自定薪酬或者滥发津贴、补贴、奖金等，对直接责任者和领导责任者，情节较轻的，给予警告或者严重警告处分；情节较重的，给予撤销党内职务或留党察看处分；情节严重的，给予开除党籍处分。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '根据集团公司廉政谈话制度相关要求，诫勉谈话应在对群众反映或举报的问题进行调查核实、弄清情况后进行，具体由纪委、监察室、权属单位党群工作部负责组织实施，谈话应以集体谈话与个别谈话相结合的方式进行。',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：谈话应以个别谈话方式进行']
    },


    {
        question: '权属单位对项目劳务分包单位管理至少每半年进行一次检查，并保留检查记录。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '集团公司对项目实行集团监控、权属单位管理、项目经理负责的管理体系，项目经理按规定行使权力，同时要接受集团公司、权属单位对其行为的管理。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '项目经理部对各劳务分包单位在施工生产和经营管理过程中的管理水平、施工能力、人员素质、合法用工、文明生产等各方面要实现动态监管，以便有效降低经济纠纷及项目运营风险。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },



    {
        question: '根据中国共产党《监督执纪工作规则（试行）》规定，应当把纪律挺在前面，把握树木与森林的关系，运用监督执纪“四种形态”，让“红红脸、出出汗”成为常态；党纪轻处分、组织调整成为违纪处理的大多数；党纪重处分，重大职务调整的成为少数；严重违纪违法、立案审查的成为极少数。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '10、质量事故发生后事故发生单位隐瞒不报、谎报、故意拖延报告期限的，故意破坏现场的，阻碍调查工作正常进行的，拒绝提供与事故有关情况、资料的，提供伪证的，由上级主管部门按有关规定给予行政处分。构成犯罪的，由司法机关依法追究刑事责任。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },

    {
        question: '企业实行厂务公开要在企业党委领导下进行。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },
    {
        question: '职工代表大会民主评议国有企业领导人员工作应每年进行一次。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '职工代表大会民主评议国有企业领导人员，有利于加强企业党风建设和领导班子建设，建立规范有效的内部监督和约束机制，防止国有企业领导人员行为失范、权力失控、决策失误。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '严禁私人向工会财务借现金和支票。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },
    {
        question: '根据《工会法》的规定，侵占工会经费和财产拒不返还的，工会可以向人民法院提起诉讼，要求返还，并赔偿损失。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '相关部门要对材料采购合同进行审查，审查内容有采购材料是否与采购计划相一致、质量要求是否明确、价格是否合理、到货时间与数量是否合适、结算方式是否公平。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '严重违纪涉嫌犯罪接受组织审查的，应当向社会公开发布。',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '关于制定监督执纪规则的必要性考虑是，全面从严治党，纪检机关首先要把自己摆进去，扎紧制度的笼子',
        type: 'checking',
        options: [],
        result: ['A'],
        explain: []
    },


    {
        question: '某项目将一份超过300万的合同拆分成几个标的额较小的合同，这样可以自行签订不用集团公司审核',
        type: 'checking',
        options: [],
        result: ['B'],
        explain: ['解析：集团公司《合同管理办法》中规定集团公司权属各单位签订的合同，超过300万（含本数）应当报送集团公司对合同进行审批。以拆分合同规避集团公司审核，是违反集团公司管理规定的。']
    }



];

var data2 = [{
        question: '《关于实行党风廉政建设责任制的规定》规定，实行党风廉政建设责任制，要坚持党委统一领导，（），纪委组织协调，部门各负其责，依靠群众的支持和参与。',
        type: 'radio',
        options: [
            '党政齐抓共管',
            '依纪依法办案',
            '政府主要负责',
            '专门机关监督'
        ],
        result: ['A'],
        explain: []
    },


    {
        question: '《廉政准则》规定，党员领导干部禁止利用职权和职务上的影响谋取不正当利益。不准利用知悉或者掌握的( )谋取利益。',
        type: 'radio',
        options: [
            '内幕信息',
            '公告信息',
            '公开信息',
            '财经信息'
        ],
        result: ['A'],
        explain: []
    },
    {
        question: '《〈廉政准则〉实施办法》规定，利用自己主管、管理、经手公共财物的权力以及管理、经手公共财物的便利，用公款报销或者支付应由个人负担的费用的，以（）论。',
        type: 'radio',
        options: [
            '受贿 ',
            '职务侵占',
            '贪污',
            '挪用公款'
        ],
        result: ['C'],
        explain: []
    },

    {
        question: '《关于实行党风廉政建设责任制的规定》规定，党委（党组）应当将贯彻落实党风廉政建设责任制的情况，专题报告上一级党委（党组）和纪委。（ ）',
        type: 'radio',
        options: [
            '每季度 ',
            '每半年',
            '每年',
            '每两年'
        ],
        result: ['C'],
        explain: []
    },
    {
        question: '挪用公款归个人使用时间不足三个月，但数额较大的，（）',
        type: 'radio',
        options: [
            '给予组织处理 ',
            '责令退还公款，可免予处分',
            '依照挪用公款行为处理  ',
            '追究刑事责任'
        ],
        result: ['C'],
        explain: []
    },

    {
        question: '《中国共产党纪律处分条例》规定，违反“收支两条线”规定和国库集中收付制度，应当纳入法定账簿的资产未纳入法定账簿或者转为账外的，追究（ ）的责任。',
        type: 'radio',
        options: [
            '主要责任者和其他直接责任人员',
            '重要领导责任者',
            '直接责任者 ',
            '主要领导责任者'
        ],
        result: ['A'],
        explain: []
    },

    {
        question: '下列哪种行为一定违反了《中国共产党党员领导干部廉洁从政若干准则》中关于禁止违反公共财物管理和使用的规定（）。',
        type: 'radio',
        options: [
            '借用公款、公物或者将公款、公物借给他人',
            '用公款参与高消费娱乐.健身活动和获取各种形式的俱乐部会员资格',
            '用公款购买商业保险，缴纳住房公积金，发津贴、补贴、奖金等',
            '用公款购买食品看望生活困难职工'
        ],
        result: ['B'],
        explain: []
    },



    {
        question: '《中国共产党党员领导干部廉洁从政若干准则》中规定，不准党员领导干部干预和插手（ ）重组改制、兼并、破产、产权交易、清产核资、资产评估、资产转让、重大项目投资以及其他重大经营活动等事项。',
        type: 'radio',
        options: [
            '民营企业',
            '乡镇企业',
            '国有企业',
            '以上都是'
        ],
        result: ['C'],
        explain: []
    },



    {
        question: '《廉政准则》规定，党员领导干部不准违反规定拥有非上市公司(企业)的（ ）。',
        type: 'radio',
        options: [
            '股票汇票',
            '股份或者证券',
            '资金和资本',
            '以上都是'
        ],
        result: ['B'],
        explain: []
    },



    {
        question: '《关于党政机关工作人员个人证券投资行为若干规定》规定，要规范党政机关工作人员个人证券投资行为，这其中不包括（ ）。',
        type: 'radio',
        options: [
            '买卖股票',
            '买卖证券投资基金',
            '买卖其他股票类证券及其衍生产品',
            '买卖政府债券'
        ],
        result: ['D'],
        explain: []
    },



    {
        question: '《廉政准则》规定，党员领导干部禁止利用职权和职务上的影响谋取不正当利益。不准利用知悉或者掌握的 ( )谋取利益。',
        type: 'radio',
        options: [
            '内幕信息',
            '公告信息',
            '公开信息',
            '财经信息'
        ],
        result: ['A'],
        explain: []
    },





    {
        question: '《廉政准则》规定，党员领导干部禁止私自从事营利性活动。不准违反规定拥有（）的股份或者证券。',
        type: 'radio',
        options: [
            '上市公司',
            '股份公司',
            '私营企业',
            '非上市公司(企业)'
        ],
        result: ['D'],
        explain: []
    },


    {
        question: '社会主义法制的基本内容可概括为16个字。（ ）',
        type: 'radio',
        options: [
            '有法可依，有法必依，严格执法，依法行政',
            '有法可依，有法必依，执法必严，违法必究',
            '有法可依，依法行政，严格执法，违法必究',
            '有法可依，违法必究，严格执法，依法行政'
        ],
        result: ['B'],
        explain: []
    },



    {
        question: '《廉政准则》规定，党员领导干部禁止脱离实际，弄虚作假，损害群众利益和党群干群关系。不准搞（）和沽名钓誉的“政绩工程”。',
        type: 'radio',
        options: [
            '劳民伤财的“形象工程”',
            '符合客观规律的“工程”',
            '违背群众意愿的“工程”',
            '破坏科学发展的“工程”'
        ],
        result: ['A'],
        explain: []
    },



    {
        question: '党员受到警告处分一年内，受到严重警告处分（）内，不得在党内提升职务和向党外组织推荐担任高于其原任职务的党外职务。',
        type: 'radio',
        options: [
            '一年',
            '一年半',
            '两年',
            '三年'
        ],
        result: ['B'],
        explain: []
    },



    {
        question: '集团公司在选拔干部工作中，对提拔任用的需任前公示（ ）个工作日。',
        type: 'radio',
        options: [
            '一',
            '三',
            '五',
            '七'
        ],
        result: ['C'],
        explain: []
    },

    {
        question: '按照集团公司有关规定，领导人员综合评价包括政治素质、履职能力、工作绩效、（ ）等四项内容。',
        type: 'radio',
        options: [
            '廉洁从业 ',
            '作风建设',
            '恪尽职守',
            '服从领导'
        ],
        result: ['A'],
        explain: []
    },




    {
        question: '根据集团公司《权属单位领导人员责任追究暂行办法》规定，给集团公司造成资产损失或不良影响受到撤销党内职务以上纪律处分或免职（解聘）组织处理的权属单位领导人员，（ ）年内不得担任集团公司权属单位或机关部门领导职务。',
        type: 'radio',
        options: [
            '一  ',
            '三 ',
            '五',
            '七'
        ],
        result: ['C'],
        explain: []
    },



    {
        question: '根据集团公司廉政谈话制度相关规定：“与一个单位或一个部门在一个时期出现的苗头性、倾向性问题的主要领导干部的谈话。谈话时要在认真客观评价分析的基础上，指出存在的问题及严重性和危害性，并对今后的工作重点或方向提出具体建议、希望和要求”,属于哪一种谈话类型（）',
        type: 'radio',
        options: [
            '任职廉政谈话',
            '诫勉谈话',
            '警示谈话',
            '批评谈话'
        ],
        result: ['C'],
        explain: []
    },


    {
        question: '项目要严格执行集团公司的劳务分包管理制度，在确定劳务分包单位过程中，严禁暗箱操作、个人拍板。严禁使用亲属或列入（  ）的劳务分包单位。',
        type: 'radio',
        options: [
            '集团公司A级劳务分包单位',
            '集团公司B级劳务分包单位',
            '集团公司C级劳务分包单位',
            '集团公司劳务黑名单'
        ],
        result: ['D'],
        explain: []
    },


    {
        question: '根据《中共山东省委实施＜中国共产党问责条例＞办法》，问责应当坚持“三个区分开来”： (  )、(  )、(  )',
        type: 'radio',
        options: [
            '把在推进改革中因缺乏经验、先行先试出现的失误和错误，同明知故犯的违纪违法行为区分开来',
            '把上级尚无明确限制的探索性试验中的失误和错误，同上及明令禁止依然我行我素的违纪违法行为区分开来',
            '把推动发展的无意过失，同为谋取私利的违纪违法行为区分开来',
            '把工作中的失误和工作责任区分开来'
        ],
        result: ['C'],
        explain: []
    },




    {
        question: '抓好劳务队伍的管理和监控，坚持（  ）选择劳务队伍。',
        type: 'radio',
        options: [
            '个人拍板',
            '会议决定',
            '招、竞标',
            '领导安排'
        ],
        result: ['C'],
        explain: []
    },



    {
        question: '为建立和完善各项廉政监督制度，按照高速集团党委要求，进一步完善与劳务分包单位签订（  ）的制度。',
        type: 'radio',
        options: [
            '质量合同',
            '进度合同',
            '廉政合同',
            '安全生产合同'
        ],
        result: ['C'],
        explain: []
    },



    {
        question: '企业应成立由（  ）组成的监督小组，负责监督检查厂务公开内容是否真实、全面，公开是否及时，程序是否符合规定，职工反映的意见是否得到落实，并组织职工对厂务公开工作进行评议和监督。要制定厂务公开的监督检查办法，形成制约和激励机制。',
        type: 'radio',
        options: [
            '职工代表',
            '纪检部门有关人员',
            '工会有关人员',
            '纪检、工会有关人员和职工代表'
        ],
        result: ['D'],
        explain: []
    },



    {
        question: '职工代表大会民主评议的对象主要是国有独资企业、国有控股企业（含国有独资金融企业和国有控股金融企业）及其分支机构的（  ）。职工代表大会民主评议的具体人员，由各地区、各有关部门、各企业根据企业实际情况确定。',
        type: 'radio',
        options: [
            '领导班子及成员',
            '一般职工',
            '中层干部',
            '职工代表'
        ],
        result: ['A'],
        explain: []
    },
    {
        question: '（  ）是本企业职工代表大会民主评议国有企业领导人员工作的主要责任人，要重视和支持职工代表大会开展民主评议工作。企业工会作为职工代表大会的工作机构，要协同企业组织人事和纪委等相关部门做好职工代表大会民主评议的具体组织工作。',
        type: 'radio',
        options: [
            '企业党委（党组）书记、董事长、总经理',
            '企业党委（党组）书记',
            '企业董事长、总经理',
            '企业工会主席'
        ],
        result: ['A'],
        explain: []
    },



    {
        question: '帮扶资金专款专用，任何单位和个人不得截留、（ ）和挪用，必须全部用于困难职工。',
        type: 'radio',
        options: [
            '侵占',
            '侵吞',
            '挤占',
            '霸占'
        ],
        result: ['B'],
        explain: []
    },

    {
        question: '工会组织的重大资金支出实行集体决策和审批，并建立（  ）。',
        type: 'radio',
        options: [
            '责任追究制度',
            '绩效考核年度',
            '奖罚制度',
            '领导责任制'
        ],
        result: ['A'],
        explain: []
    },



    {
        question: '材料的验收是指（ ），要为工程质量终身制把好材料源头关。',
        type: 'radio',
        options: [
            '外观质量和内在质量',
            '采购数量',
            '质量',
            '质量与数量'
        ],
        result: ['D'],
        explain: []
    },


    {
        question: '招标人采用邀请招标方式的，应当向（ ）个以上具备承担招标项目的能力、资信良好的特定的法人或其他组织发出投标邀请书。',
        type: 'radio',
        options: [
            '2 ',
            '3 ',
            '4',
            '5'
        ],
        result: ['B'],
        explain: []
    },



    {
        question: '某权属单位计划采购一台预算价格200万元的通用设备，按照集团公司相关规定，应采用哪种采购方式。（ ）',
        type: 'radio',
        options: [
            '公开招标',
            '竞争性谈判',
            '询价',
            '单一来源采购'
        ],
        result: ['A'],
        explain: []
    },



    {
        question: '为降低在订立合同中人为因素导致合同产生重大风险，降低在合同签订中出现“一言堂”等滋生腐败的问题，集团公司《合同管理办法》中根据合同标的额确定合同审批层级，下列选项中哪些表述是正确的（ ）',
        type: 'radio',
        options: [
            '300万以下的合同可以不经审核直接签订',
            '300万（含本数）-500万的合同审批至集团公司总法律顾问层级',
            '500万（含本数）-1000万的合同审批至集团公司总法律顾问层级',
            '1000万以上标的额的合同审批至集团公司分管副总经理'
        ],
        result: ['B'],
        explain: []
    }
];

var data3 = [{
        question: '《关于实行党政领导干部问责的暂行规定》规定，对党政领导干部实行问责时，下列哪些属于应当从重问责的情节：______（ ）  ',
        type: 'multi',
        options: [
            '干扰、阻碍问责调查的',
            '弄虚作假、隐瞒事实真相的',
            '对检举人、控告人打击、报复、陷害的',
            '党内法规和国家法律法规规定的其他从重情节'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },



    {
        question: '《党章》规定，党的各级领导干部要加强道德修养，讲党性、重品行、作表率，做到_______，反对官僚主义，反对任何滥用职权、谋求私利的不正之风。（   ）  ',
        type: 'multi',
        options: [
            '自重 ',
            '自省 ',
            '自警',
            '自励'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },



    {
        question: '《廉政准则》规定，党员领导干部禁止利用职权和职务上的影响谋取不正当利益。不准 (   )管理和服务对象以及其他与行使职权有关系的单位或者个人的财物。  ',
        type: 'multi',
        options: [
            '索取 ',
            '接受',
            '以借为名占用 ',
            '强行霸占'
        ],
        result: ['A', 'B', 'C'],
        explain: []
    },


    {
        question: '《廉政准则》规定，党员领导干部禁止违反公共财物管理和使用的规定，假公济私、化公为私。不准违反规定(  )。  ',
        type: 'multi',
        options: [
            '借用公款',
            '借用公物 ',
            '将公款借给他人',
            '将公物借给他人'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },


    {
        question: '《廉政准则》规定，党员领导干部禁止违反公共财物管理和使用的规定，假公济私、化公为私。不准违反规定用公款(  ) 。 ',
        type: 'multi',
        options: [
            '购买商业保险',
            '缴纳住房公积金',
            '滥发津贴、补贴、奖金',
            '发放职工工资'
        ],
        result: ['A', 'B', 'C'],
        explain: []
    },





    {
        question: '《廉政准则》规定，党员领导干部禁止利用职权和职务上的影响为亲属及身边工作人员谋取利益。不准要求或者指使提拔(   ) 。   ',
        type: 'multi',
        options: [
            '配偶',
            '子女及其配偶 ',
            '其他亲属',
            '身边工作人员'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },

    {
        question: '《廉政准则》规定，党员领导干部禁止违反规定干预和插手市场经济活动，谋取私利。不准干预和插手(   )、矿产资源开发利用、中介机构服务等市场经济活动。  ',
        type: 'multi',
        options: [
            '建设工程项目承发包',
            '土地使用权出让',
            '政府采购 ',
            '房地产开发与经营'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },
    {
        question: '《廉政准则》规定，党员领导干部禁止违反规定干预和插手市场经济活动，谋取私利。不准干预和插手国有企业重组改制、兼并、破产、(   )、重大项目投资以及其他重大经营活动等事项。  ',
        type: 'multi',
        options: [
            '产权交易',
            '清产核资 ',
            '资产评估 ',
            '资产转让'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },




    {
        question: '贯彻实施《廉政准则》，要坚持党内监督与党外监督相结合，发挥(   ) 的监督作用。  ',
        type: 'multi',
        options: [
            '民主党派',
            '人民团体',
            '人民群众',
            '新闻舆论'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },


    {
        question: '《廉政准则》规定，党员领导干部禁止违反公共财物管理和使用的规定，假公济私、化公为私。不准挪用或者拆借(   ) 。  ',
        type: 'multi',
        options: [
            '社会保障基金',
            '住房公积金',
            '其他公共资金',
            '其他财政资金 '
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },


    {
        question: '《廉政准则》规定，党员领导干部禁止脱离实际，弄虚作假，损害群众利益和党群干群关系。不准在(  ) 等事项中优亲厚友、显失公平。  ',
        type: 'multi',
        options: [
            '社会保障 ',
            '政策扶持 ',
            '救灾救济款物分配',
            '以上都不是 '
        ],
        result: ['A', 'B', 'C'],
        explain: []
    },




    {
        question: '《廉政准则》规定，党员领导干部禁止讲排场、比阔气、挥霍公款、铺张浪费。不准违反规定(  ) 或者使用小汽车。  ',
        type: 'multi',
        options: [
            '配备',
            '购买',
            '更换',
            '装饰'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },





    {
        question: '国有企业领导人员不得有将国有资产（  ）给配偶、子女及其他特定关系人经营。  ',
        type: 'multi',
        options: [
            '委托 ',
            '租赁',
            '承包 ',
            '赠送 '
        ],
        result: ['A', 'B', 'C'],
        explain: []
    },


    {
        question: '集团公司党风廉政建设责任制规定，受到责任追究的领导班子、领导人员，取消当年年度（ ）和评选各类（ ）的资格。  ',
        type: 'multi',
        options: [
            '考核评优',
            '先进 ',
            '奖金',
            '奖项'
        ],
        result: ['A', 'B'],
        explain: []
    },

    {
        question: '下列须提交“三重一大”集体决策的是（ ）。 ',
        type: 'multi',
        options: [
            '重大决策 ',
            '重要人事任免',
            '重大项目安排',
            '大额度资金使用'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },


    {
        question: '党组织在国有企业中发挥领导核心和政治核心作用，公司党委研究讨论是经理层决策重大问题的前置程序，归结到一点，就是（）、（）、（）。 ',
        type: 'multi',
        options: [
            '把方向 ',
            '管大局 ',
            '保落实',
            '抓执行'
        ],
        result: ['A', 'B', 'C'],
        explain: []
    },




    {
        question: '国有企业领导人员的“20字要求”是（）、（）、（）、兴企有为、清正廉洁。 ',
        type: 'multi',
        options: [
            '对党忠诚',
            '勇于创新',
            '治企有方',
            '爱岗敬业 '
        ],
        result: ['A', 'B', 'C'],
        explain: []
    },


    {
        question: '在干部选拔任用工作中，不得列为考察对象的情形有群众公认度不高的、（）、（）、（）、（）、其他原因不宜提拔的。  ',
        type: 'multi',
        options: [
            '近三年年度考核结果中有被确定为基本称职以下等次的 ',
            '有跑官、拉票行为的',
            '配偶已移居国（境）外；或者没有配偶，子女均已移居国（境）外的',
            '受到党组织处理或者党纪政纪处分影响使用的'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },


    {
        question: '下列属于劳务分包违规的有（   ）  ',
        type: 'multi',
        options: [
            '私自分包',
            '超合同分包 ',
            '小合同大结算 ',
            '虚报工程量'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },






    {
        question: '劳务分包单位哪些行为会导致进入集团黑名单（  ） ',
        type: 'multi',
        options: [
            '相互串通投标，或者以行贿等不正当手段谋取中标的 ',
            '分包工程层层分包或转包的 ',
            '出现重大质量、安全事故或谎报、拖延报告、破坏事故现场、阻碍对事故调查的 ',
            '与集团公司发生法律纠纷的 '
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },


    {
        question: '项目合同经办部门对合同争议不得（   ），必须严格保证诉讼时效的延续，确保争议事项的解决不超过诉讼时效。  ',
        type: 'multi',
        options: [
            '隐瞒 ',
            '回避 ',
            '拖延 ',
            '报告 '
        ],
        result: ['A', 'B', 'C'],
        explain: []
    },
    {
        question: '项目要严格执行集团公司的劳务分包管理制度，在确定劳务分包队伍过程中，严禁（  ）。  ',
        type: 'multi',
        options: [
            '暗箱操作',
            '个人拍板',
            '使用亲属',
            '使用列入集团公司劳务黑名单的劳务分包单位'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },


    {
        question: '集团公司质量目标（ ）。  ',
        type: 'multi',
        options: [
            '工程一次性检验合格率100% ',
            '满足业主对工程产品的质量要求和期望 ',
            '工程质量超过国内同行业先进水平，争创国际先进水平 ',
            '质量第一，争创一流 '
        ],
        result: ['A', 'B', 'C'],
        explain: []
    },
    {
        question: '质量事故处理实行“三不放过”原则，具体为（   ）。  ',
        type: 'multi',
        options: [
            '危险源不排除不放过',
            '事故原因不清不放过',
            '事故责任者和群众没有受到教育不放过',
            '没有防范措施不放过'
        ],
        result: ['B', 'C', 'D'],
        explain: []
    },


    {
        question: '集团公司对工程质量事故实行追究制度，根据调查报告对事故责任人给予（  ）。  ',
        type: 'multi',
        options: [
            '开除党籍',
            '开除公职',
            '行政处分',
            '经济处罚'
        ],
        result: ['C', 'D'],
        explain: []
    },
    {
        question: '厂务公开应公开与企业领导班子建设和党风廉政建设密切相关的问题。主要包括民主评议企业领导人员情况以及（   ）。  ',
        type: 'multi',
        options: [
            '企业中层领导人员、重要岗位人员的选聘和任用情况',
            '干部廉洁自律规定执行情况',
            '企业业务招待费使用情况',
            '企业领导人员工资（年薪）、奖金、兼职、补贴、住房、用车、通信工具使用情况，以及出国出境费用支出情况等 '
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },

    {
        question: '在 《关于进一步做好职工代表大会民主评议国有企业领导人员工作的意见》 中，明确要将（   ）和实行厂务公开情况等，作为职工代表大会民主评议的重要内容，使职工代表大会制度在促进国有企业党的建设、推动科学发展、构建和谐企业中充分发挥作用。  ',
        type: 'multi',
        options: [
            '贯彻中央关于企业重大决策、重要人事任免、重大项目安排和大额度资金运作"三重一大"事项决策制度的执行情况',
            '企业领导人员廉洁从业情况',
            '涉及职工切身利益重大事项的决策及执行情况　',
            '重要规章制度的制定及执行情况 '
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },
    {
        question: '各地区、各有关部门要高度重视职工代表大会民主评议国有企业领导人员工作，加强组织协调和工作指导，共同做好此项工作。（ ）。',
        type: 'multi',
        options: [
            '纪检监察部门要把民主评议作为建立健全惩治和预防腐败体系建设的重要工作内容，将群众监督和效能监察有效结合起来，完善拒腐防变长效机制，提高反腐倡廉成效。',
            '党委组织部门、国有资产监督管理部门要把民主评议作为综合考核评价企业领导人员的重要形式和有效监管国有资产的重要手段，将民主评议结果作为奖惩、任免干部的重要依据。',
            '工会组织要把民主评议作为维护职工合法权益的制度平台，促进劳动关系和谐稳定。',
            '工商联组织要指导非公有制企业结合实际，积极探索适合非公有制企业特点的职工代表大会民主评议内容和方式，稳步推进此项工作。'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },


    {
        question: '下列属于《工会法》中规定的职工“工资总额”计算范畴的有：（  ）  ',
        type: 'multi',
        options: [
            '基本工资',
            '津贴、补贴',
            '奖金',
            '加班工资'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },


    {
        question: '工会财务工作应按照上级规定和财务制度认真编制经费预算，工会经费支出：（  ）  ',
        type: 'multi',
        options: [
            '执行预算 ',
            '执行经费开支范围和开支标准',
            '分清经费渠道，合理使用经费 ',
            '控制预算外开支。 '
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },






    {
        question: '为了杜绝类似西安地铁“问题电缆”的现象，作为施工单位，我们应做好以下工作（  ）。  ',
        type: 'multi',
        options: [
            '在采购前做好供应市场调查 ',
            '执行集团公司招标采购规定',
            '制定合理的评标办法',
            '对采购进场的物资设备要严格质量和数量把控，做好检验检测。'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },

    {
        question: '设备采购到场后要进行验收工作，验收过程分为以下（  ）步骤。  ',
        type: 'multi',
        options: [
            '初验：检查设备的规格、型号、数量、外包装及装箱附件等内容 ',
            '测试：核对设备各项配置，并对设备功能、性能等项目进行检测  ',
            '试运行：测试合格后新设备交使用部门试运行，试运行结束后，使用部门须提交详细的试运行报告，以作为设备是否满足合同要求和是否进行最终验收的依据。',
            '最终验收：设备验收小组依据测试报告、试运行报告等相关资料，出具验收报告。'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    },
    {
        question: '为提高完好率和利用率，集团公司应加强设备和周转材料的（  ）。 ',
        type: 'multi',
        options: [
            '集中管理 ',
            '专业管理 ',
            '分散管理 ',
            '交由劳务队伍管理 '
        ],
        result: ['A', 'B'],
        explain: []
    },


    {
        question: '在处理合同纠纷时，以下哪些处理方式是正确的（  ）  ',
        type: 'multi',
        options: [
            '按合同约定采取诉讼或仲裁的方式解决 ',
            '经办人为尽快处理纠纷，在未经批准的情况下与对方达成协议',
            '通过法院调解双方达成协议 ',
            '双方协商解决达成一致，并签订补充条款 '
        ],
        result: ['A', 'C', 'D'],
        explain: []
    },

    {
        question: '合同履行过程中，发现合同对方当事人有哪些情形时，在收集到证明材料并经集团公司分管领导同意后，可以暂缓履行合同。（   ） ',
        type: 'multi',
        options: [
            '经营状况或者财务状况严重恶化',
            '转移财产、抽逃资金以逃避债务 ',
            '丧失商业信誉',
            '丧失或者可能丧失履行债务能力的其它情形'
        ],
        result: ['A', 'B', 'C', 'D'],
        explain: []
    }
]


var data = [];

data = data.concat(data1);
data = data.concat(data2);
data = data.concat(data3);